БИТУправление_медицинским_центром_демо/src/Catalogs/invПродукт/invПродукт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>invПродукт</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>КодПродукта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>400</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТолькоВСоставеПрофиля</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.ПолФизическихЛиц</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипПродукта</name>
    <type>
      <types>EnumRef.invТипПродукта</types>
    </type>
  </attributes>
  <attributes>
    <name>URLОписанияПродукта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Преаналитика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокВыполнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ВыборБМ</name>
    <attributes>
      <name>ВариантВыбораБМ</name>
      <type>
        <types>CatalogRef.invВыборБМ</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

БИТУправление_медицинским_центром_демо/src/InformationRegisters/НоменклатураАнализов/НоменклатураАнализов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НоменклатураАнализов</name>
  <resources>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Исключен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Helix_MultiplePositions</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Helix_MultipleRules</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Лаборатория</name>
    <type>
      <types>CatalogRef.Лаборатории</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БИТУправление_медицинским_центром_демо/src/Enums/ВнешниеЛаборатории/ВнешниеЛаборатории.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВнешниеЛаборатории</name>
  <enumValues>
    <name>Helix</name>
  </enumValues>
  <enumValues>
    <name>Invitro</name>
  </enumValues>
  <enumValues>
    <name>СитиЛаб</name>
  </enumValues>
  <enumValues>
    <name>КДЛ</name>
  </enumValues>
  <enumValues>
    <name>Гемотест</name>
  </enumValues>
</mdclass:Enum>

БИТУправление_медицинским_центром_демо/src/Enums/ВидыНоменклатуры/ВидыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыНоменклатуры</name>
  <comment>Виды номенклатуры</comment>
  <enumValues>
    <name>Материал</name>
    <comment>Основной вид ТМЦ, учитываемый на складах</comment>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
    <comment>Услуга, не хранится на складах</comment>
  </enumValues>
  <enumValues>
    <name>Набор</name>
  </enumValues>
</mdclass:Enum>

БИТУправление_медицинским_центром_демо/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>НаименованиеПолное</name>
    <comment>Полное наименование</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНоменклатуры</name>
    <comment>Вид номенклатуры</comment>
    <type>
      <types>EnumRef.ВидыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ВестиУчетПоХарактеристикам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БазоваяЕдиницаИзмерения</name>
    <comment>Базовая единица измерения</comment>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПродолжительностьЧас</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПродолжительностьМин</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаХраненияОстатков</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаТоваров</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПланируетсяБезСотрудника</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПланируетсяБезОборудования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТолькоДляПланирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнешнийКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияВыработки</name>
    <type>
      <types>CatalogRef.КатегорииВыработки</types>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Анализ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндивидуальныйШаблонОсмотра</name>
    <type>
      <types>CatalogRef.ШаблоныHTML</types>
    </type>
  </attributes>
  <attributes>
    <name>TRADENAME</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>LATNAME</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>REGNUM</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>REGDATE</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FIRM_REGISTRATOR</name>
    <comment>Организация-регистратор</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>COUNTRY_REGISTRATOR</name>
    <comment>Страна организации-регистратора</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>FIRM_MANUFACTOR</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>COUNTRY_MANUFACTOR</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>PHARMGROUP</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>URL</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>STATUS</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>NDV</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>REGCERTID</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>PHARMAACTIONS</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>STRONG</name>
    <type>
      <types>EnumRef.СильнодействующиеИЯды</types>
    </type>
  </attributes>
  <attributes>
    <name>JNVLS</name>
    <type>
      <types>EnumRef.СпискиЖНиВЛП</types>
    </type>
  </attributes>
  <attributes>
    <name>NARCO</name>
    <type>
      <types>EnumRef.СпискиНаркотическихВеществ</types>
    </type>
  </attributes>
  <attributes>
    <name>Архив</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПродолжительностьЕдиницыУслуги</name>
    <comment>Одна единица услуги имеет данную продолжительность</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатураМедицинскихУслуг</name>
    <type>
      <types>CatalogRef.НоменклатураМедицинскихУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>удалитьСтавкаНДС</name>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодготовкаКлиентаКСдачеАнализа</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>DICOMModality</name>
    <type>
      <types>CatalogRef.DICOMModality</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСтавкиНДС</name>
    <type>
      <types>EnumRef.ВидыСтавокНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>МедосмотрСправка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьЦенаМедосмотраИзДействийМедосмотра</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВестиУчетПоСериям</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КЛП</name>
    <comment>Код лекарства в ЕСКЛП РФ</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>41</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АТХ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодМедУслуги</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодТРУ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НормализованнаяФорма</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВредныйФакторСправки</name>
    <type>
      <types>CatalogRef.ПереченьВредныхФакторовИРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособФомированияЦеныМедосмотра</name>
    <type>
      <types>EnumRef.СпособФормированияЦеныМедосмотра</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрагентПринципал</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КомплектующиеНоменклатуры</name>
    <attributes>
      <name>Комплектующая</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаКомплектующей</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СопутствующиеТовары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Оборудования</name>
    <attributes>
      <name>Оборудование</name>
      <type>
        <types>CatalogRef.МоделиОборудования</types>
        <types>CatalogRef.Оборудование</types>
      </type>
    </attributes>
    <attributes>
      <name>Филиал</name>
      <type>
        <types>CatalogRef.Филиалы</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОборудованиеDICOM</name>
    <attributes>
      <name>Оборудование</name>
      <type>
        <types>CatalogRef.Оборудование</types>
      </type>
    </attributes>
    <attributes>
      <name>Филиал</name>
      <type>
        <types>CatalogRef.Филиалы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

БИТУправление_медицинским_центром_демо/src/Catalogs/invПродукт/Forms/ФормаРаботыСоСправочниками/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьСписокДанныхНоменклатурНаСервере();
			
	СоздаватьНовуюНоменклатуру = Истина;
	ОбновлятьРеквизитыНоменклатурыПриПовторнойЗагрузке = Истина;
	ИзменятьГруппуНоменклатурыПриПовторнойЗагрузке = Истина;
	
	Лаборатории = Справочники.Лаборатории.Выбрать();
	Пока Лаборатории.Следующий() Цикл
		Если Лаборатории.ВнешняяЛаборатория = Перечисления.ВнешниеЛаборатории.Invitro Тогда
			Лаборатория = Лаборатории.Ссылка;
		КонецЕсли;
	КонецЦикла;
	
	Элементы.Подразделение.СписокВыбора.ЗагрузитьЗначения(invИнвитроСервер.ВернутьМсПодразделенийСНастройками());
	Если Элементы.Подразделение.СписокВыбора.Количество() > 0 Тогда
		Подразделение = Элементы.Подразделение.СписокВыбора[0].Значение;
		Если Номенклатура.ПолучитьЭлементы().Количество() = 0 Тогда
			Элементы.Страницы.ТекущаяСтраница = Элементы.РаботаСоСправочникамиИнвитро;
		КонецЕсли;
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Ни для одного подразделения не заданы настройки интеграции с Инвитро!'"));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура НадписьКодыПродуктовCOVID19Нажатие(Элемент)

	ОткрытьФорму("Справочник.invПродукт.Форма.КодыПродуктовCOVID19",, ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
#Область РаботаСТЧПродуктов
&НаКлиенте
Процедура СнятьФлажки(Команда)
	УстановитьЗначениеФлажков(Ложь);	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	УстановитьЗначениеФлажков(Истина);
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПометкаПриИзменении(Элемент)
	
	ТекущаяСтрока = Номенклатура.НайтиПоИдентификатору(Элементы.Номенклатура.ТекущаяСтрока);
	УстановитьЗначениеФлажков(ТекущаяСтрока.Пометка, ТекущаяСтрока.ПолучитьЭлементы())
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗначениеФлажков(ЗначениеУстанавливаемойПометки, СтрокиДерева = Неопределено)
	Попытка
		Если СтрокиДерева = Неопределено Тогда
			СтрокиДерева = Номенклатура.ПолучитьЭлементы();
		КонецЕсли;		
		Для Каждого Строка Из СтрокиДерева Цикл
			// Вызвать реккурсию
			Строка.Пометка = ЗначениеУстанавливаемойПометки;
			УстановитьЗначениеФлажков(ЗначениеУстанавливаемойПометки,Строка.ПолучитьЭлементы());
		КонецЦикла;
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не удалось!'"));
	КонецПопытки	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьНоменклатуру(Команда)
	
	Если ПоляЗаполнены() Тогда
		ДобавитьНоменклатуруНаСервере();
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не все поля заполнены'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПоляЗаполнены()
	  Возврат ЗначениеЗаполнено(Лаборатория) И ЗначениеЗаполнено(ГруппаЗагрузкиНоменклатуры) И ЗначениеЗаполнено(СпециализацияНоменклатуры)
КонецФункции

&НаСервере
Процедура ДобавитьНоменклатуруНаСервере()
	
	НачатьТранзакцию();
	Для Каждого СтрокаДерева Из Номенклатура.ПолучитьЭлементы() Цикл
		// Отдельная процедура для выполнения всего переноса в транзакции.
		ДобавитьНоменклатуруНаСервереПодстроки(СтрокаДерева);
	КонецЦикла;
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьНоменклатуруНаСервереПодстроки(СтрокаДерева = Неопределено)
	
	СтрокиДерева = СтрокаДерева.ПолучитьЭлементы();
	Если СтрокиДерева.Количество() = 0 Тогда 
		ЭтоГруппа = Ложь;
	Иначе
		ЭтоГруппа = Истина;
	КонецЕсли;
	
	Если СтрокаДерева.Пометка Тогда
		Если ЗначениеЗаполнено(СтрокаДерева.Номенклатура) Тогда 
			НоменклатураОбъект = СтрокаДерева.Номенклатура.ПолучитьОбъект();
		ИначеЕсли СоздаватьНовуюНоменклатуру Тогда
			НоменклатураОбъект = ?(ЭтоГруппа,Справочники.Номенклатура.СоздатьГруппу(),Справочники.Номенклатура.СоздатьЭлемент());
		КонецЕсли;	
		
		Если НоменклатураОбъект <> Неопределено Тогда
			// Заполним общие реквизиты для группы и элемента.
			Если НоменклатураОбъект.Ссылка.Пустая()
				Или ОбновлятьРеквизитыНоменклатурыПриПовторнойЗагрузке
			Тогда
				НаименованиеНоменклатуры = СтрокаДерева.Продукт.ПолноеНаименование;
				Если ПустаяСтрока(НаименованиеНоменклатуры) Тогда
					НаименованиеНоменклатуры = Строка(СтрокаДерева.Продукт);
				КонецЕсли;
				НоменклатураОбъект.Наименование = НаименованиеНоменклатуры;
			КонецЕсли;
			
			РодительПродукт = СтрокаДерева.ПолучитьРодителя();
			ЭтоВерхнийУровень = СтрокаДерева.ПолучитьРодителя() = Неопределено;
			Если ЭтоВерхнийУровень Тогда
				РодительНоменклатура = ГруппаЗагрузкиНоменклатуры;
			Иначе
				РодительНоменклатура = ?(СтрокаДерева.ПолучитьРодителя().Номенклатура = Неопределено, ГруппаЗагрузкиНоменклатуры, СтрокаДерева.ПолучитьРодителя().Номенклатура);
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(СтрокаДерева.Номенклатура) Или ИзменятьГруппуНоменклатурыПриПовторнойЗагрузке Тогда
				НоменклатураОбъект.Родитель = invИнвитроСервер.ПолучитьГруппуНоменклатурыАнализа(РодительПродукт, РодительНоменклатура, СтрокаДерева.Продукт, ИзменятьГруппуНоменклатурыПриПовторнойЗагрузке);	
			КонецЕсли;
			
			Если Не ЭтоГруппа Тогда
				Если ОбновлятьРеквизитыНоменклатурыПриПовторнойЗагрузке
					Или НоменклатураОбъект.Ссылка.Пустая()
				Тогда
					НоменклатураОбъект.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Услуга;
					НоменклатураОбъект.Анализ = Истина;
					НоменклатураОбъект.НаименованиеПолное	= НоменклатураОбъект.Наименование;
					НоменклатураОбъект.Комментарий			= СтрокаДерева.Продукт.Преаналитика;	
					НоменклатураОбъект.КатегорияВыработки	= СпециализацияНоменклатуры;
					НоменклатураОбъект.Артикул 				= СтрокаДерева.КодПродукта;
				КонецЕсли;
			КонецЕсли;
			
			НоменклатураОбъект.Записать();
			invИнвитроСервер.ЗаписатьСоответствиеНоменклатурыАнализа(НоменклатураОбъект.Ссылка,СтрокаДерева.Продукт);
			СтрокаДерева.Номенклатура = НоменклатураОбъект.Ссылка;
			Если Не ЭтоГруппа Тогда
				Запись = РегистрыСведений.НоменклатураАнализов.СоздатьМенеджерЗаписи();
				Запись.Номенклатура 			= СтрокаДерева.Номенклатура;
				Запись.Лаборатория	 			= Лаборатория;
				Запись.ID 						= СтрокаДерева.КодПродукта;
				Запись.Записать();
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;

	// Обойдём подчинённые элементы.
	Для Каждого Строка Из СтрокиДерева Цикл
		ДобавитьНоменклатуруНаСервереПодстроки(Строка)
	КонецЦикла;
	
КонецПроцедуры
	
#КонецОбласти 

#Область УстаревшиеПродукты
&НаКлиенте
Процедура УстановитьЗначениеФлажковУстаревшие(ЗначениеУстанавливаемойПометки)
	Для каждого УстаревшийПродукт Из НоменклатураУстаревшая Цикл
		УстаревшийПродукт.Пометка =  ЗначениеУстанавливаемойПометки;
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажкиУстаревшие(Команда)
	УстановитьЗначениеФлажковУстаревшие(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажкиУстаревшие(Команда)
	УстановитьЗначениеФлажковУстаревшие(Истина);
КонецПроцедуры


&НаСервереБезКонтекста
Функция ПометитьНаУдалениеНаСервере(МсНоменклатура, Лаборатория)
	Возврат invИнвитроСервер.ПометитьНаУдалениеУстаревшуюНоменклатура(МсНоменклатура, Лаборатория);		
КонецФункции

&НаКлиенте
Процедура ПометитьНаУдаление(Команда)
	
	МсНоменклатура = Новый Массив;
	Для каждого УстаревшаяНоменклатура Из НоменклатураУстаревшая Цикл
		Если УстаревшаяНоменклатура.Пометка Тогда
			МсНоменклатура.Добавить(УстаревшаяНоменклатура.Номенклатура);
		КонецЕсли;
	КонецЦикла;	 
	
	МсНеудаленные = ПометитьНаУдалениеНаСервере(МсНоменклатура, Лаборатория);
	НоменклатураУстаревшая.Очистить();
	Для каждого НеудаленнаяНоменклатура Из МсНеудаленные Цикл
	  НовСтр = НоменклатураУстаревшая.Добавить();
	  НовСтр.Пометка = Истина;
	  НовСтр.Номенклатура = НеудаленнаяНоменклатура;
	КонецЦикла;
	
	Если НоменклатураУстаревшая.Количество() = 0 Тогда
		Элементы.УстаревшиеПродукты.Видимость = Ложь;
		Элементы.СтраницыПродукты.ТекущаяСтраница = Элементы.Продукты;
	КонецЕсли;

КонецПроцедуры
	
#КонецОбласти 


// Очистка информации Инвитро
&НаКлиенте
Процедура ОчиститьСправочники(Команда)
	invИнвитроСервер.ОчиститьСправочникиНаСервере();
КонецПроцедуры

// Получение информации Инвитро.
&НаКлиенте
Процедура ПолучитьПродуктыИДопИнформацию(Команда)
	Если ЗначениеЗаполнено(Подразделение) Тогда
		invИнвитроСервер.ПолучитьДопИнформациюИПродуктыНаСервере(Подразделение);	
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Укажите подразделение!'"));
	КонецЕсли;
	ОбновитьСписокДанныхНоменклатурНаСервере();
	Элементы.Страницы.ТекущаяСтраница = Элементы.ЗагрузкаНоменклатуры;
КонецПроцедуры

Процедура ОбновитьСписокДанныхНоменклатурНаСервере()
	ДанныеНомен = invИнвитроСервер.ПолучитьДанныеНоменклатурыАнализов();
	ЗначениеВРеквизитФормы(ДанныеНомен.ДеревоНоменклатуры,"Номенклатура");
		
	НоменклатураУстаревшая.Загрузить(ДанныеНомен.Устаревшие);
	Если НоменклатураУстаревшая.Количество() > 0 Тогда
		Элементы.СтраницыПродукты.ТекущаяСтраница = Элементы.УстаревшиеПродукты;
	Иначе
		Элементы.УстаревшиеПродукты.Видимость = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СохранитьЦены(Команда)
	
	Если НЕ ЗначениеЗаполнено(Подразделение) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Заполните подразделение!'"),, "Подразделение");
		Возврат;
	КонецЕсли;
	
	ДокументУстановкиЦен = invИнвитроСервер.ОбновитьЦеныПродуктов(Подразделение);
	
	Если ДокументУстановкиЦен <> Неопределено Тогда
		ПоказатьЗначение(Неопределено, ДокументУстановкиЦен);
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти
